ConfigFiles/DataProcessors/КонтрольОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>КонтрольОбъектов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ConfigFiles/InformationRegisters/ОбъектыНаКонтроле.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыНаКонтроле</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУказанияРезультата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторическаяЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехническийПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяДатаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СписокКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
						<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/DataProcessors/КонтрольОбъектов/Forms/НаКонтролеУДругих/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьДанныеФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыЯКонтролирую

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		
		ПоказатьЗначение( ,ВыбраннаяСтрока.Ключ);
		
	ИначеЕсли Поле.Имя = "СписокОбъектКонтроля" Тогда
		
		ПоказатьЗначение(, ДанныеСтроки.ОбъектКонтроля);
		
	ИначеЕсли Поле.Имя = "СписокТехническийПроект" Тогда
		
		Если ЗначениеЗаполнено(ДанныеСтроки.ТехническийПроект) Тогда
			ПоказатьЗначение(, ДанныеСтроки.ТехническийПроект);
		Иначе
			ПоказатьЗначение(, ДанныеСтроки.ОбъектКонтроля);
		КонецЕсли;
		
	Иначе
		
		ОткрытьФормуУказанияРезультата();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ИсторияКонтроля(Команда)
	
	ОчиститьСообщения();
	
	ОбъектыНаКонтролеКлиент.ОткрытьИсториюКонтроляИзСпискаКонтроля(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьРезультат(Команда)
	
	ОткрытьФормуУказанияРезультата();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуУказанияРезультата()

	ОчиститьСообщения();
	
	Отказ = Ложь;
	
	ИзменяемыеСтрокиСписка = ОбъектыНаКонтролеКлиент.ИзменяемыеСтрокиСписка(Элементы.Список, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИзменяемыеСтрокиСписка", ИзменяемыеСтрокиСписка);
	
	ИзменяемыеСтрокиСпискаСписок = Новый СписокЗначений;
	ИзменяемыеСтрокиСпискаСписок.ЗагрузитьЗначения(ИзменяемыеСтрокиСписка);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИзменяемыеСтрокиСписка", ИзменяемыеСтрокиСпискаСписок);
	
	ДанныеИзменяемыхСтрок = ОбъектыНаКонтролеКлиент.ДанныеИзменяемыхСтрок(Элементы.Список, ИзменяемыеСтрокиСписка);
	
	ИмяОткрываемойФормы = "ИзменениеРезультат";
	Если ДанныеИзменяемыхСтрок <> Неопределено Тогда
		ПараметрыФормы.Вставить("ТекущееСостояниеДел", ДанныеИзменяемыхСтрок.Результат);
		ПараметрыФормы.Вставить("ДатаКонтроля",        ДанныеИзменяемыхСтрок.ДатаКонтроля);
		ПараметрыФормы.Вставить("Решение",             ДанныеИзменяемыхСтрок.Решение);
	КонецЕсли;
	
	ОповещениеОИзмененииЗаписей = Новый ОписаниеОповещения("ПослеУказанияРезультата", 
	                                                        ЭтотОбъект,
	                                                        ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.КонтрольОбъектов.Форма.ИзменениеРезультат", 
	             ПараметрыФормы, ЭтотОбъект,,,,
	             ОповещениеОИзмененииЗаписей, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 


&НаСервере
Процедура ИнициализироватьДанныеФормы()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущийПользователь", ТекущийПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУказанияРезультата(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено
		Или Результат = КодВозвратаДиалога.Отмена Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОтразитьИзменениеРезультата(Результат, ДополнительныеПараметры.ИзменяемыеСтрокиСписка);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьИзменениеРезультата(СостояниеДел, КлючиЗаписей)
	
	Для Каждого КлючЗаписи Из КлючиЗаписей Цикл
		
		РегистрыСведений.ОбъектыНаКонтроле.ОтразитьИзменениеРезультата(КлючЗаписи, СостояниеДел);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
